In [1]:
import numpy as np
import pandas as pd

/home/ec2-user/anaconda3/envs/python3/lib/python3.10/site-packages/pandas/core/computation/expressions.py:21: UserWarning: Pandas requires version '2.8.4' or newer of 'numexpr' (version '2.7.3' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED

In [3]:
df = pd.DataFrame({"VAL1": [2, 4, 6, np.nan, 51, np.nan]
    })
df

   VAL1
0   2.0
1   4.0
2   6.0
3   NaN
4  51.0
5   NaN

In [7]:
df[df["VAL1"].notnull()]

   VAL1
0   2.0
1   4.0
2   6.0
4  51.0

In [12]:
df.notnull().any()

VAL1    True
dtype: bool

In [15]:
df.dropna()

   VAL1
0   2.0
1   4.0
2   6.0
4  51.0

In [23]:
df["VAL1"].fillna(df["VAL1"].mean(), inplace=True)
df

    VAL1
0   2.00
1   4.00
2   6.00
3  15.75
4  51.00
5  15.75

In [ ]:
df.